const NewsDatabase = [{
    id: 1, preview: "style/VanTube News Preview.png", headers: "У VanTube появился свой официальный сайт", text: `<p>У VanTube появилась страница с новостями.</p>
                            <p>Теперь вы можете узнать об нововведениях и обновлениях VanTube в любое время.</p>
                            <p></p>
                            <p></p>`, data: "14.02.2026"
},
{
    id: 2, preview: "style/VanTube News Preview.png", headers: "У сайта VanTube появилась страница с новостями", text: `<p>У VanTube появилась страница с новостями.</p>
    <p>Теперь вы можете узнать об нововведениях и обновлениях VanTube в любое время.</p>
    <p></p>
    <p></p>`, data: "20.02.2026"
},
{
    id: 3, preview: "style/VanTube News Preview 2.png", headers: "VanTube больше не будет получать обновления на Классике", text: `<p>VanTube перестанет обновлятся на версиях браузера "Козел" для Shindows SG Classic начиная с 1 марта 2026 года. Это связано с тем что поддержка Shindows SG Classic закончилась. Также это связано с тем что в ближайшем будущем сертификаты безопасности на версиях "Козла" для Shindows SG Classic станут устаревшими.</p>
    <p>Но несмотря на это пользователи смогут смотреть видео на VanTube и пользоваться режимом разработчика. Однако мы рекомендуем перейти на поддерживаемые версии Shindows SG, так пользоваться VanTube на Shindows SG Classic небезопасно (и Shindows может поломаться)</p>
    <p></p>
    <p></p>`, data: "22.02.2026"
},
{
    id: 4, preview: "style/VanTube News Preview 3.png", headers: "У VanTube теперь есть канал в VK", text: `<p><p>Теперь вы можете смотреть наши видео и выкладывать свои в нашем ВК канале.</p>
    <p>В скором времени на платформе ВК также появятся наши сервисы VanTube Music и VanTube Short.</p>
    <p>Следите и узнавайте за нами в новостях на нашем сайте.</p>
    <p></p>`, data: "07.03.2026"
},
{
    id: 5, preview: "style/VanTube News Preview 4.png", headers: "У TG VanTube день рождения, нам 1 год", text: `<p>15 марта ТГ каналу VanTube будет 1 год. За это время сервис получил множество обновлений и нововведений.</p>
    <p>Все начиналось с того, что был создан на то время ещё малоизвестный канал нашего видеосервиса, 
     который позволил бы привлечь создателей конента на новую платформу. Уже после появился бот, 
     который позволил авторам контента без доступа админа-контентмейкера вылаживать видео на VanTube (пускай с проверкой видео главами платформы). 
     В будущем по блату множество контент-мейкеров получили доступ к публикации видео на платформе без использования бота 
     ,что значительно увеличило количество видео на платформе. </p>
    <p>После этого платформа активно развивалась, вышло множество обновлений связанных с появлением новых форматов видео и новых приложений VanTube - VanTube Short и Music. </p>
    <p>Мы активно продолжаем обновлять сервис и привлекать множество людей к созданию творчества на платформе. И в честь ДР мы подготовили подарок к дню рождения. А именно: бесплатный доступ к VanTube Premium на время, получение прав админа контент-мейкера на всех платформах VanTube в ТГ и ВК.</p>
    <p>Для того чтобы все это получить вам нужно присоединится к розыгрышу в нашем офиц тг канале (количество победителей будет большое).</p>
    <p>Огромное спасибо вам за использование нашей платформы</p>`, data: "14.03.2026"
},
{
    id: 6, preview: "style/VanTube News Preview 5.png", headers: "Официальная Блокировка ТГ в России, что делать?", text: `<p>1 апреля 2026 года свершилась окончательная блокировка Telegram в РФ. Для многих людей, в том числе и пользователей VanTube TG это является большой проблемой.</p>
    <p>Первое что мы можем посоветовать пользователям нашего проекта - перейти в наш канал в <a href="https://vk.ru/club236356285">VK</a> 
       или в наш чат в мессенджере <a href="https://kozlyatnik.fwh.is/?i=1">Козлятнике</a> (чтобы найти его напишите в поиске чатов "VanTube") </p>
    <p>Либо же вы можете использовать различные способы обхода блокировок (по типу VPN или прокси, который можно активировать прямо в самом ТГ)</p>
    <p>Эти советы позволят вам оставаться на связи в наеш непростое время</p>
    <p></p>
    <p></p>`, data: "01.04.2026"
},
{
    id: 7, preview: "style/VanTube News Preview 6.png", headers: "У VanTube появится собственный API!", text: `<p>VanTube теперь выпускает свое API 🎉. Этот API позволит публиковать видео на VanTube без использования сервиса VanTube TG. </p>
    <p>На данный момент этот продукт находится на стадии тестирования, но разработчики VanTube уже активно работают над его созданием. </p>
    <p>Поэтому в ближайшее время VanTube API может стать доступным для общедоступного использования.</p>
    <p>Однако вы по прежнему сможете использовать сервис VanTube TG для публикации своего творчества.</p>
    <p></p>
    <p></p>`, data: "08.04.2026"
},
{
    id: 8, preview: "style/VanTube News Preview.png", headers: "Обновление VanTube, добавление дата-базы сайта", text: `<p> У VanTube наконец-то появилась база данных на базе JavaScript. </p>
    <p>Это позволит сделать наш сайт более функциональным и динамическим, что облегчит: работу над созданием новых новостей, поиск информации на сайте и т.д . В будущем мы планируем добавить множество новых функций на сайте (в том числе и API для загрузки видео)</p>
    <p>Мы очень надеемся, что это изменение порадует пользователей VanTube.</p>
    <p></p>
    <p></p>`, data: "08.04.2026"
},
{
    id: 9, preview: "style/VanTube News Preview 7.png", headers: "Добавление поиска на сайте", text: `<p> У VanTube появилась своя поисковая страница </p>
    <p>На странице вбив нужные сивмолы вы можете найти одну или несколько страниц (в том числе и видео на сайте), в названии которых есть эти символы (английского или русского алфавита)</p>
    <p>На экране для просмотра найденных страниц, можно изменить параметр поиска - (страницы или видео на сайте)</p>
    <p>В будущем поиск будет обновляться и добавятся новые функции для поиска</p>
    <p></p>`, data: "25.05.2026"
}
, {
    id: 10, preview: "style/VanTube News Preview 8.png", headers: "Летний сезон на VanTube", text: `<p>Мы поздравляем пользователей VanTube с началом летнего сезона</p>
    <p>Во время этого сезона на сайте появится множество новых видео на летнюю тематику, чтобы вы могли насладиться этим летом вместе с нами.</p>
    <p>Мы очень надеемся что этот летний сезон и лето пройдут у вас интересно, весело и продуктивно</p>
    <p></p>
    <p></p>`, data: "05.06.2026"
},
{
    id: 11, preview: "style/VanTube News Preview.png", headers: "Крупное обновление VanTube - добавление видеоплеера", text: `<p>На официальном сайте VanTube наконец-то появился собственный видеоплеер</p>
    <p>Видео-плеер имеет все базовые функции для воспроизведения видео - (включение, пауза, перемотка видео с помощью ползунка, включение/выключение звука, регулирование звука с помощью ползунка). Список функций будет обновлятся, а сам плеер станет еще лучше.</p>
    <p>Попробовать использование плеера можно, кликнув по <a href="видео-страница.html?id=1">ссылке</a></p>
    <p></p>
    <p></p>`, data: "05.06.2026"
}, 
{
    id: 12, preview: "style/VanTube News Preview.png", headers: "Крупное обновление VanTube - новый сервер для хранения видео и датабазы!", text: `<p>У нашего офиц сайта наконец-то появился собственный сервер для хранения большого количества видео и датабазы сайта ,предназначенной для подгрузки видео, результатов поиска и нвостей.</p>
    <p>Сервер имеет более 400гб свободного места, что является достаточно хорошим показателем для нас</p>
    <p>Все наши видео вы можете увидеть на <a href="видео.html">главной странице с видео</a></p>
    <p></p>
    <p></p>`, data: "02.07.2026"
}];
const PageDatabase = [{id:"1", name:"Главная страница (index)", description:"Главная страница сайта VanTube, здесь вы можете узнать основную информацию о нашем сервисе VanTube", url:"index.html"},
{id:"2", name:"Обратная связь", description:"Ссылки на наши аккаунты в других сервисах", url:"обратная связь.html"},
{id:"3", name:"О нас (about)", description:"Здесь мы можете узнать дополнительную информацию и историю о VanTube", url:"о нас.html"},
{id:"4", name:"Сообщество", description:"Подробнее об сообществе VanTube", url:"сообщество.html"},
{id:"5", name:"Новости", description:"Здесь можно узнать о последних новостях и обновлениях VanTube", url:"новости.html"},
{id:"6", name:"Другие сервисы", description:"Информация и ссылки на другие сервисы VanTube Inc", url:"другие сервисы.html"},
{id:"7", name:"Видео", description:"Страница с рекомендованными видео для просмотра", url:"видео.html"}];

const VideoDatabase = [{ id:"1", name:"Windows в PowerPoint'е", src:"video_in_vantube/style/video №1.mp4", poster:"https://i.ytimg.com/vi/I5VcCqK6pPM/hqdefault.jpg?sqp=-oaymwEcCNACELwBSFXyq4qpAw4IARUAAIhCGAFwAcABBg==&rs=AOn4CLD2I1wynZtq9pTQjCZqIJN0_f_XzQ", description:`Посмотреть полное видео с более хорошим качеством можно в <a href="https://t.me/VanTube_official/2">нашем TG</a>`, author:"Vanko Corporation"}, 
{ id:"2", name:"Windows 8 в PowerPoint'е", src:"video_in_vantube/style/video №2.mp4", poster:"https://i.ytimg.com/vi/hmSQgVujhhA/hqdefault.jpg?sqp=-oaymwEcCNACELwBSFXyq4qpAw4IARUAAIhCGAFwAcABBg==&rs=AOn4CLDC8VSK1HJhJJafhNsBH8EXOSK3zQ", description:`Посмотреть полное видео с более хорошим качеством можно в <a href="https://t.me/VanTube_official/6">нашем TG</a>`, author:"Vanko Corporation"}, 
{ id:"3", name:"Трейлер релиза Shindows SG Visla! (3-летие шиндофандома)", src:"video_in_vantube/style/video №3.mp4", poster:"https://i.ytimg.com/vi/3kABfFOf2j8/hqdefault.jpg?sqp=-oaymwEcCPYBEIoBSFXyq4qpAw4IARUAAIhCGAFwAcABBg==&rs=AOn4CLBGehqfSrmo8r-vVr4teNLjNEjlOA", description:`Посмотреть полное видео с более хорошим качеством можно в <a href="https://t.me/VanTube_official/303">нашем TG</a> или <a href="https://www.youtube.com/watch?v=3kABfFOf2j8"> Ютуб канале</a>`, author:"Vanko Corporation"}, 
{ id:"4", name:"ОТКУДА ОН ЗНАЕТ?! #vanko #memes #powerpoint #meme #мем", src:"video_in_vantube/style/video №4.mp4", poster:"https://i.ytimg.com/vi/HGWZ-UWUIf0/oar2.jpg?sqp=-oaymwEdCJUDENAFSFWQAgHyq4qpAwwIARUAAIhCcAHAAQY=&rs=AOn4CLDN6O_ADk6SQCX0lSnQA9ysn8qUdQ&usqp=CCk", description:`Посмотреть полное видео с более хорошим качеством можно в <a href="https://t.me/VanTube_official/275">нашем TG</a>`, author:"ГригорийПончик"}];